#+TODO:TODO(t@) WORKING(w!) IDEA(i@) | DONE(d@) REJECTED(r@)
#+TODO:REPORT(r@) BUG(b@) KNOWNCAUSE(k@) | FIXED(f@)
#+ARCHIVE: ::* Archived

* TODO Сделать вкладку со сделками
  - [ ] Note taken on [2011-03-13 Вск 02:53] \\
    сортировка при клике на колонку
  - [X] Note taken on [2011-03-13 Вск 02:46] \\
    добавить колонку дата во вью
  - [X] Note taken on [2011-03-13 Вск 01:54] \\
    колонки во вью 
    1. id
    2. бумага
    3. направление
    4. количество
    5. цена
  CLOCK: [2011-03-13 Вск 01:50]--[2011-03-13 Вск 03:34] =>  1:44
  - State "TODO"       from ""           [2011-03-11 Птн 12:45] \\
    вкладка с деревом сделок в котором отображаются все данные по сделкам
    введенным в базу. Вложенность в дереве сделок определяется уровнем
    расписанности сделки. Кнопка с хоткеем для быстрого ручного добавления
    сделок, в том числе парных. Возможность удаления сделок. Фильтр по
    дате, бумаге, количеству, цене, направлению сделки, а также по статусу
    сделки, возможность перехода к позиции, которой сделка принадлежит.
    
* TODO Сделать вкладке с позициями
  - State "TODO"       from ""           [2011-03-11 Птн 12:51] \\
    Вкладка с позициями. Возможность разбития отдельных позиций и всех
    сразу. Возможность ручного комбинирования сделок в позиции (скорее
    всего это во вкладке со сделками лучше сделать). Фильтр для сделок по
    бумаге, лось / профит, длинная / короткая, количество цена открытия
    цена закрытия, дата.

* TODO Переделать вкладку с отчетом
  - State "TODO"       from ""           [2011-03-11 Птн 16:25] \\
    Сделать генерацию отчета одной кнопкой по которой будет всплывать
    диалог с датой начала, датой конца, списком чекбоксов для выбора
    списка акций, количеством профита, лося

* DONE Поправить непонятку с диалогом выбора файлов
  - State "DONE"       from "TODO"       [2011-03-12 Сбт 20:43] \\
    надо было использовать RESPONSE_CANCEL и RESPONSE_ACCEPT
  - State "TODO"       from ""           [2011-03-12 Сбт 01:26] \\
    когда открываешь файл отчета или базу данных или еще что либо, то
    нельзя сделать двойной щелчек по файлу

* DONE Для фьючей переделать импортер
  - State "DONE"       from "TODO"       [2011-03-12 Сбт 00:47] \\
    старые тесты проходят но нужен дополнительный тест на проверку коммиссии
  - Note taken on [2011-03-12 Сбт 00:23] \\
    если сказать точнее то не равномерно а пропорцонально объему сделки
  CLOCK: [2011-03-11 Птн 16:44]--[2011-03-11 Птн 17:24] =>  0:40
  CLOCK: [2011-03-11 Птн 16:29]--[2011-03-11 Птн 16:38] =>  0:09
  - State "TODO"       from ""           [2011-03-11 Птн 16:27] \\
    для фьючей из отчета вытаскивать сууму комиссий за период и равномерно
    распределять ее по сделкам за этот период.

** DONE сделать тест для проверки импортера
   - State "DONE"       from "TODO"       [2011-03-12 Сбт 01:21] \\
     тесты немного переделаны и пофиксены
   CLOCK: [2011-03-12 Сбт 00:48]--[2011-03-12 Сбт 01:21] =>  0:33
* DONE Заставить тесты снова работать
  - State "DONE"       from "TODO"       [2011-03-12 Сбт 00:15] \\
    Да здравствует программирование управляемое тестами !!!
    были косяки с уникальными полями - оказывается часто встречаются
    сделки с одинаковой датой ценой бумагой и количеством. 
    По этому решил сделать новое уникальное поле sha1 от вышеуказанного +
    deal_number и order_number из отчета открытия
  - Note taken on [2011-03-11 Птн 23:34] \\
    ошибка возникает когда пытаешся разбить сделку на сделки с равным
    quantity в этом случае нарушается уникальность сделки по составному ключу
  CLOCK: [2011-03-11 Птн 23:15]--[2011-03-12 Сбт 00:12] =>  0:57
  CLOCK: [2011-03-11 Птн 17:25]--[2011-03-11 Птн 17:31] =>  0:06
  - State "TODO"       from ""           [2011-03-11 Птн 17:25] \\
    Это после исправления опечаток с констрейнами. так как констрейны
    теперь соблюдаются правильно надо переписать разбивалку сделок так как
    она пытается создать не уникальные записи
